In [1]:
import pandas as pd

In [2]:
drsft1 = pd.read_csv('ex1.csv')
drsft1

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [4]:
type(drsft1)

pandas.core.frame.DataFrame

In [5]:
drsft1.head()

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
drsft1.tail()

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [7]:
drsft1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
a          3 non-null int64
b          3 non-null int64
c          3 non-null int64
d          3 non-null int64
message    3 non-null object
dtypes: int64(4), object(1)
memory usage: 248.0+ bytes

In [8]:
drsft1.describe()

         a     b     c     d
count  3.0   3.0   3.0   3.0
mean   5.0   6.0   7.0   8.0
std    4.0   4.0   4.0   4.0
min    1.0   2.0   3.0   4.0
25%    3.0   4.0   5.0   6.0
50%    5.0   6.0   7.0   8.0
75%    7.0   8.0   9.0  10.0
max    9.0  10.0  11.0  12.0

In [9]:
drsft1.isnull()

       a      b      c      d  message
0  False  False  False  False    False
1  False  False  False  False    False
2  False  False  False  False    False

In [10]:
drsft1.isnull().sum()

a          0
b          0
c          0
d          0
message    0
dtype: int64

In [11]:
drsft1.isnull().mean()

a          0.0
b          0.0
c          0.0
d          0.0
message    0.0
dtype: float64

In [12]:
pd.read_csv('ex2.csv')

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [13]:
pd.read_csv('ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

# REad Tsv Data

In [14]:
draft2 = pd.read_table('test.tsv')
draft2

        test   test test.1 test.2 test.3
sudh    sudh   sudh   sudh   sudh   sudh
kumar  kumar  kumar  kumar  kumar  kumar

In [15]:
draft2 = pd.read_csv('test.tsv')
draft2

              test\t test\ttest\ttest\ttest
0        sudh\tsudh\tsudh\tsudh\tsudh\tsudh
1  kumar\tkumar\tkumar\tkumar\tkumar\tkumar

In [16]:
pd.read_table('ex1.csv')

  a,b,c,d,message
0   1,2,3,4,hello
1   5,6,7,8,world
2  9,10,11,12,foo

In [17]:
draft3 = pd.read_table('ex1.csv', sep=',')
draft3

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [18]:
draft3 = pd.read_table('ex1.csv', sep=',', header=None)
draft3

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

# wanted to give your own column

NameError: name 'df' is not defined

In [24]:
df = pd.read_csv('ex2.csv', names=['sdfs','sdfsdaf','sghdf','sdf','sdfsd'])
df

   sdfs  sdfsdaf  sghdf  sdf  sdfsd
0     1        2      3    4  hello
1     5        6      7    8  world
2     9       10     11   12    foo

In [25]:
df = pd.read_csv('ex2.csv', names=['sdfs','sdfsdaf','sghdf','sdf','sdfsd','One_new_col'])
df

   sdfs  sdfsdaf  sghdf  sdf  sdfsd  One_new_col
0     1        2      3    4  hello          NaN
1     5        6      7    8  world          NaN
2     9       10     11   12    foo          NaN

In [29]:
df = pd.read_table('test.tsv', names = ['1','2','3','4','5'])
df

       1      2      3      4      5
0   test   test   test   test   test
1   sudh   sudh   sudh   sudh   sudh
2  kumar  kumar  kumar  kumar  kumar

# Multiple indexing option

In [30]:
parsed = pd.read_csv('csv_mindex.csv')
parsed

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [31]:
parsed.head()

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10

In [32]:
parsed.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
key1      8 non-null object
key2      8 non-null object
value1    8 non-null int64
value2    8 non-null int64
dtypes: int64(2), object(2)
memory usage: 384.0+ bytes

In [33]:
parsed.describe()

          value1     value2
count   8.000000   8.000000
mean    8.000000   9.000000
std     4.898979   4.898979
min     1.000000   2.000000
25%     4.500000   5.500000
50%     8.000000   9.000000
75%    11.500000  12.500000
max    15.000000  16.000000

In [36]:
parsed = pd.read_csv('csv_mindex.csv', index_col ='key1' )
parsed

     key2  value1  value2
key1
one     a       1       2
one     b       3       4
one     c       5       6
one     d       7       8
two     a       9      10
two     b      11      12
two     c      13      14
two     d      15      16

# Skip Rows

In [37]:
pd.read_csv('ex4.csv')

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [41]:
pd.read_csv('ex4.csv', skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [42]:
pd.read_csv('ex4.csv', skiprows=[0,2,3], header=None)

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

#### We have some Nan kind of value s

In [43]:
result  = pd.read_csv('ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [44]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [45]:
result.isnull()

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [46]:
result.isnull().sum()

something    0
a            0
b            0
c            1
d            0
message      1
dtype: int64

# Read Excel File

In [47]:
draft3 = pd.read_excel('test1.xlsx')
draft3

   ahbdc  hs  sdf  ojh
0    1.0   3  2.0  1.0
1    2.0   3  NaN  5.0
2    NaN   3  5.0  NaN
3    1.0   2  3.0  4.0
4    NaN   1  NaN  NaN

In [48]:
draft3 = pd.read_excel('test1.xlsx', sheet_name='Sheet1')
draft3

   ahbdc  hs  sdf  ojh
0    1.0   3  2.0  1.0
1    2.0   3  NaN  5.0
2    NaN   3  5.0  NaN
3    1.0   2  3.0  4.0
4    NaN   1  NaN  NaN

In [50]:
draft3.columns

Index(['ahbdc', 'hs', 'sdf', 'ojh'], dtype='object')

# Data Read from HTML file

In [52]:

url = "http://localhost:8889/view/02%20-%20Data%20Analysis/fdic_failed_bank_list.html"

BB_data = pd.read_html(url)         # Read data from the specified url

ValueError: No tables found

# Data REad from Git Hub

In [ ]:
easy task to perform

In [53]:
import pandas as pd

In [54]:
pd.options.display.max_rows = 10

In [59]:
result = pd.read_csv('ex6.csv')
pd.options.display.max_rows = 20
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [60]:
result.head(10)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q
5  1.817480  0.742273  0.419395 -2.251035   Q
6 -0.776764  0.935518 -0.332872 -1.875641   U
7 -0.913135  1.530624 -0.572657  0.477252   K
8  0.358480 -0.497572 -0.367016  0.507702   S
9 -1.740877 -1.160417 -1.637830  2.172201   G

In [61]:
pd.read_csv('ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [62]:
chunk = pd.read_csv('ex6.csv', chunksize=1000)

In [63]:
chunk

# How to save data in HDD

In [65]:
data = pd.read_csv('ex5.csv', header=None)
data

           0  1   2    3   4        5
0  something  a   b    c   d  message
1        one  1   2    3   4      NaN
2        two  5   6  NaN   8    world
3      three  9  10   11  12      foo

In [66]:
data.to_csv('csv_file_created_by_me.csv')

In [69]:
import sys
data.to_csv('csv_file_created_by_me_eithdiffer@seppereter.csv', sep='@')

In [70]:
data.to_csv(sys.stdout, na_rep = 'Null')

,0,1,2,3,4,5
0,something,a,b,c,d,message
1,one,1,2,3,4,Null
2,two,5,6,Null,8,world
3,three,9,10,11,12,foo

In [71]:
data

           0  1   2    3   4        5
0  something  a   b    c   d  message
1        one  1   2    3   4      NaN
2        two  5   6  NaN   8    world
3      three  9  10   11  12      foo

In [72]:
data.to_csv('csv_file_created_by_me.csv', index = False, header=False)

In [73]:
data

           0  1   2    3   4        5
0  something  a   b    c   d  message
1        one  1   2    3   4      NaN
2        two  5   6  NaN   8    world
3      three  9  10   11  12      foo

In [74]:
dates = pd.date_range('1/1/2000', periods=7)
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

In [75]:
pd.DataFrame(dates)

           0
0 2000-01-01
1 2000-01-02
2 2000-01-03
3 2000-01-04
4 2000-01-05
5 2000-01-06
6 2000-01-07

In [76]:
type(dates)

pandas.core.indexes.datetimes.DatetimeIndex

In [77]:
import numpy as np 
ts = pd.Series(np.arange(7))
ts

0    0
1    1
2    2
3    3
4    4
5    5
6    6
dtype: int32

In [78]:
type(ts)

pandas.core.series.Series

In [80]:
ts = pd.Series(np.arange(7), index=dates)
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int32

In [82]:
dates = pd.date_range('1/1/2000', periods=7)
ts = pd.Series(np.arange(7), index = dates)
ts.to_csv('tseries__22.csv')

c:\users\lenovo\appdata\local\programs\python\python36\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  This is separate from the ipykernel package so we can avoid doing imports until

# Working with PANDAS

In [83]:
import csv
f = open('ex7.csv')

reader = csv.reader(f)
reader

In [84]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

# another option and another way

In [85]:
with open('ex7.csv') as f:
    lines = list(csv.reader(f))
lines

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3']]

In [86]:
lines

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3']]

In [87]:
a = 1
b = 'abhi'
c = 23

In [88]:
a,b,c = 1,'abhi',23

In [89]:
print(a)
print(b)
print(c)

1
abhi
23

In [90]:
header, values = lines[0], lines[1:]

In [91]:
header

['a', 'b', 'c']

In [92]:
values

[['1', '2', '3'], ['1', '2', '3']]

In [93]:
list(zip(values))

[(['1', '2', '3'],), (['1', '2', '3'],)]

In [94]:
list(zip(*values))

[('1', '1'), ('2', '2'), ('3', '3')]

In [95]:
list(zip(header, zip(*values)))

[('a', ('1', '1')), ('b', ('2', '2')), ('c', ('3', '3'))]

In [97]:
c,n = ('a',('1','1'))
print(c)
print(n)

a
('1', '1')

# Dict Comprehencion

In [98]:
data_dict = {h: v for h , v in zip(header,zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [99]:
l1 = [1,2,3,4,5]
l2 = [6,7,8,9,0]
list(zip(l1,l2))

[(1, 6), (2, 7), (3, 8), (4, 9), (5, 0)]

In [100]:
list(zip(*(l1,l2)))

[(1, 6), (2, 7), (3, 8), (4, 9), (5, 0)]

In [102]:
data_dict =  {h: v for h, h in zip(l1,l2)}
data_dict

NameError: name 'v' is not defined

# JSON Data

In [103]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [104]:
type(obj)

str

In [105]:
import json 
result = json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [106]:
type(result)

dict

In [107]:
assdc = json.dumps(result)  #convert to dict to str 
assdc

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [109]:
type(assdc)

str

In [110]:
result['siblings']

[{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
 {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]

In [111]:
siblings = pd.DataFrame(result['siblings'],columns=['name', 'age','pets'])
siblings

    name  age                    pets
0  Scott   30            [Zeus, Zuko]
1  Katie   38  [Sixes, Stache, Cisco]

In [113]:
data  = pd.read_json('example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [114]:
data.to_json()

'{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}'

In [115]:
data.to_json(orient='records')

'[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]'

In [117]:
tables = pd.read_html('fdic_failed_bank_list.html')
len(tables)

1

In [118]:
tables

[                             Bank Name             City  ST   CERT  \
 0                          Allied Bank         Mulberry  AR     91
 1         The Woodbury Banking Company         Woodbury  GA  11297
 2               First CornerStone Bank  King of Prussia  PA  35312
 3                   Trust Company Bank          Memphis  TN   9956
 4           North Milwaukee State Bank        Milwaukee  WI  20364
 ..                                 ...              ...  ..    ...
 542                 Superior Bank, FSB         Hinsdale  IL  32646
 543                Malta National Bank            Malta  OH   6629
 544    First Alliance Bank & Trust Co.       Manchester  NH  34264
 545  National State Bank of Metropolis       Metropolis  IL   3815
 546                   Bank of Honolulu         Honolulu  HI  21029

                    Acquiring Institution        Closing Date  \
 0                           Today's Bank  September 23, 2016
 1                            United Bank     August 19, 2016
 2    First-Citizens Bank & Trust Company         May 6, 2016
 3             The Bank of Fayette County      April 29, 2016
 4    First-Citizens Bank & Trust Company      March 11, 2016
 ..                                   ...                 ...
 542                Superior Federal, FSB       July 27, 2001
 543                    North Valley Bank         May 3, 2001
 544  Southern New Hampshire Bank & Trust    February 2, 2001
 545              Banterra Bank of Marion   December 14, 2000
 546                   Bank of the Orient    October 13, 2000

           Updated Date
 0    November 17, 2016
 1    November 17, 2016
 2    September 6, 2016
 3    September 6, 2016
 4        June 16, 2016
 ..                 ...
 542    August 19, 2014
 543  November 18, 2002
 544  February 18, 2003
 545     March 17, 2005
 546     March 17, 2005

 [547 rows x 7 columns]]

In [119]:
failure = tables[0]
failure.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

# Binary Data Formats

In [120]:
frame = pd.read_csv('ex1.csv')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [121]:
frame.to_pickle('savw_file not human raeadable formate')

In [122]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [123]:
pd.read_pickle('savw_file not human raeadable formate')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

# HDF5 Formate

In [125]:
frame = pd.DataFrame({'a':np.random.randn(100)})
frame

           a
0   1.169680
1   0.964412
2  -0.906468
3   1.788262
4   0.424633
..       ...
95 -0.494311
96  1.712001
97  0.584443
98 -0.663098
99 -0.010467

[100 rows x 1 columns]

In [126]:
store = pd.HDFStore('my_data_by_me_2.h5')

ImportError: Missing optional dependency 'tables'.  Use pip or conda to install tables.

# Web APi(Appplication progra,ming interface)

In [130]:
import requests
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
resp

In [128]:
import pandas as pd

In [160]:
titanic_train = pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv",
                           sep='\t')

In [161]:
titanic_train

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

In [133]:
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [134]:
titanic_train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [136]:
titanic_train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,156.000000,156.000000,156.000000,126.000000,156.000000,156.000000,156.000000
mean,78.500000,0.346154,2.423077,28.141508,0.615385,0.397436,28.109587
std,45.177428,0.477275,0.795459,14.613880,1.056235,0.870146,39.401047
min,1.000000,0.000000,1.000000,0.830000,0.000000,0.000000,6.750000
25%,39.750000,0.000000,2.000000,19.000000,0.000000,0.000000,8.003150
50%,78.500000,0.000000,3.000000,26.000000,0.000000,0.000000,14.454200
75%,117.250000,1.000000,3.000000,35.000000,1.000000,0.000000,30.371850
max,156.000000,1.000000,3.000000,71.000000,5.000000,5.000000,263.000000

# filter the column which is object

In [158]:
titanic_train[['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']]

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S
...,...,...,...,...,...
151,"Pears, Mrs. Thomas (Edith Wearne)",female,113776,C2,S
152,"Meo, Mr. Alfonzo",male,A.5. 11206,NaN,S
153,"van Billiard, Mr. Austin Blyler",male,A/5. 851,NaN,S
154,"Olsen, Mr. Ole Martin",male,Fa 265302,NaN,S
155,"Williams, Mr. Charles Duane",male,PC 17597,NaN,C

In [140]:
titanic_train[['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']].describe()

                          Name   Sex Ticket Cabin Embarked
count                      156   156    156    31      155
unique                     156     2    145    28        3
top     Ford, Mr. William Neal  male  19950   D26        S
freq                         1   100      2     2      110

In [143]:
titanic_train.dtypes =='object'

PassengerId    False
Survived       False
Pclass         False
Name            True
Sex             True
Age            False
SibSp          False
Parch          False
Ticket          True
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [144]:
a = titanic_train.dtypes[titanic_train.dtypes=='object']

In [145]:
a

Name        object
Sex         object
Ticket      object
Cabin       object
Embarked    object
dtype: object

In [146]:
a = titanic_train.dtypes[titanic_train.dtypes == 'object'].index
a

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [147]:
type(a)

pandas.core.indexes.base.Index

In [148]:
titanic_train[a].describe()

                          Name   Sex Ticket Cabin Embarked
count                      156   156    156    31      155
unique                     156     2    145    28        3
top     Ford, Mr. William Neal  male  19950   D26        S
freq                         1   100      2     2      110

In [155]:
a = titanic_train.dtypes[titanic_train.dtypes == 'int64']
a

PassengerId    int64
Survived       int64
Pclass         int64
SibSp          int64
Parch          int64
dtype: object

In [153]:
a = titanic_train.dtypes[titanic_train.dtypes == 'int64'].index
a

Index(['PassengerId', 'Survived', 'Pclass', 'SibSp', 'Parch'], dtype='object')

In [156]:
a.describe()

count         5
unique        1
top       int64
freq          5
dtype: object

In [163]:
titanic_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

# Selection

In [164]:
titanic_train['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
151                    Pears, Mrs. Thomas (Edith Wearne)
152                                     Meo, Mr. Alfonzo
153                      van Billiard, Mr. Austin Blyler
154                                Olsen, Mr. Ole Martin
155                          Williams, Mr. Charles Duane
Name: Name, Length: 156, dtype: object

In [165]:
pd.DataFrame(titanic_train['Name'])

                                                  Name
0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
..                                                 ...
151                  Pears, Mrs. Thomas (Edith Wearne)
152                                   Meo, Mr. Alfonzo
153                    van Billiard, Mr. Austin Blyler
154                              Olsen, Mr. Ole Martin
155                        Williams, Mr. Charles Duane

[156 rows x 1 columns]

In [166]:
titanic_train.Name[0]

'Braund, Mr. Owen Harris'

In [167]:
titanic_train['Name'][10:21]

10                      Sandstrom, Miss. Marguerite Rut
11                             Bonnell, Miss. Elizabeth
12                       Saundercock, Mr. William Henry
13                          Andersson, Mr. Anders Johan
14                 Vestrom, Miss. Hulda Amanda Adolfina
15                     Hewlett, Mrs. (Mary D Kingcome)
16                                 Rice, Master. Eugene
17                         Williams, Mr. Charles Eugene
18    Vander Planke, Mrs. Julius (Emelia Maria Vande...
19                              Masselmani, Mrs. Fatima
20                                 Fynney, Mr. Joseph J
Name: Name, dtype: object

In [168]:
titanic_train[['Name']][10:21]

                                                 Name
10                    Sandstrom, Miss. Marguerite Rut
11                           Bonnell, Miss. Elizabeth
12                     Saundercock, Mr. William Henry
13                        Andersson, Mr. Anders Johan
14               Vestrom, Miss. Hulda Amanda Adolfina
15                   Hewlett, Mrs. (Mary D Kingcome)
16                               Rice, Master. Eugene
17                       Williams, Mr. Charles Eugene
18  Vander Planke, Mrs. Julius (Emelia Maria Vande...
19                            Masselmani, Mrs. Fatima
20                               Fynney, Mr. Joseph J

In [169]:
titanic_train['Name'][10:21:2]

10                      Sandstrom, Miss. Marguerite Rut
12                       Saundercock, Mr. William Henry
14                 Vestrom, Miss. Hulda Amanda Adolfina
16                                 Rice, Master. Eugene
18    Vander Planke, Mrs. Julius (Emelia Maria Vande...
20                                 Fynney, Mr. Joseph J
Name: Name, dtype: object

In [170]:
titanic_train[['Name', 'Survived']][10:21:2]

                                                 Name  Survived
10                    Sandstrom, Miss. Marguerite Rut         1
12                     Saundercock, Mr. William Henry         0
14               Vestrom, Miss. Hulda Amanda Adolfina         0
16                               Rice, Master. Eugene         0
18  Vander Planke, Mrs. Julius (Emelia Maria Vande...         0
20                               Fynney, Mr. Joseph J         0

In [173]:
sorted(titanic_train['Name'])[5:10:2]

['Andersson, Mr. August Edvard ("Wennerstrom")',
 'Andrew, Mr. Edgardo Samuel',
 'Asplund, Mrs. Carl Oscar (Selma Augusta Emilia Johansson)']

In [174]:
titanic_train['Name'].describe()

count                        156
unique                       156
top       Ford, Mr. William Neal
freq                           1
Name: Name, dtype: object

# 5 min Task

In [175]:
data = pd.read_csv('ex1.csv')
data

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [176]:
data.describe()

         a     b     c     d
count  3.0   3.0   3.0   3.0
mean   5.0   6.0   7.0   8.0
std    4.0   4.0   4.0   4.0
min    1.0   2.0   3.0   4.0
25%    3.0   4.0   5.0   6.0
50%    5.0   6.0   7.0   8.0
75%    7.0   8.0   9.0  10.0
max    9.0  10.0  11.0  12.0

In [177]:
df = data.describe()
df

         a     b     c     d
count  3.0   3.0   3.0   3.0
mean   5.0   6.0   7.0   8.0
std    4.0   4.0   4.0   4.0
min    1.0   2.0   3.0   4.0
25%    3.0   4.0   5.0   6.0
50%    5.0   6.0   7.0   8.0
75%    7.0   8.0   9.0  10.0
max    9.0  10.0  11.0  12.0

In [178]:
df.to_csv('desc.csv')

In [179]:
df['a'][0::2]

count    3.0
std      4.0
25%      3.0
75%      7.0
Name: a, dtype: float64

In [180]:
sorted(df['a'][0::2])

[3.0, 3.0, 4.0, 7.0]

# Mapping

In [181]:
titanic_train['Pclass']

0      3
1      1
2      3
3      1
4      3
      ..
151    1
152    3
153    3
154    3
155    1
Name: Pclass, Length: 156, dtype: int64

In [182]:
new_Pclass = pd.Categorical(titanic_train['Pclass'])
new_Pclass

[3, 1, 3, 1, 3, ..., 1, 3, 3, 3, 1]
Length: 156
Categories (3, int64): [1, 2, 3]

In [183]:
titanic_train['Cabin']

0       NaN
1       C85
2       NaN
3      C123
4       NaN
       ...
151      C2
152     NaN
153     NaN
154     NaN
155     NaN
Name: Cabin, Length: 156, dtype: object

In [184]:
# i wqant to create a new col and store the first letter of all data
import numpy as np
char_cabiin = titanic_train['Cabin'].astype(str)
char_cabiin
result = [cabin[0] for cabin in char_cabiin]
titanic_train['cabin_1'] = result

In [185]:
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,cabin_1
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,n
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,n
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,C
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,n

# Null Values

In [186]:
titanic_train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,156.000000,156.000000,156.000000,126.000000,156.000000,156.000000,156.000000
mean,78.500000,0.346154,2.423077,28.141508,0.615385,0.397436,28.109587
std,45.177428,0.477275,0.795459,14.613880,1.056235,0.870146,39.401047
min,1.000000,0.000000,1.000000,0.830000,0.000000,0.000000,6.750000
25%,39.750000,0.000000,2.000000,19.000000,0.000000,0.000000,8.003150
50%,78.500000,0.000000,3.000000,26.000000,0.000000,0.000000,14.454200
75%,117.250000,1.000000,3.000000,35.000000,1.000000,0.000000,30.371850
max,156.000000,1.000000,3.000000,71.000000,5.000000,5.000000,263.000000

In [191]:
titanic_train['Age'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
151    False
152    False
153    False
154     True
155    False
Name: Age, Length: 156, dtype: bool

In [193]:
titanic_train['Age'].isnull() ==True

0      False
1      False
2      False
3      False
4      False
       ...
151    False
152    False
153    False
154     True
155    False
Name: Age, Length: 156, dtype: bool

In [195]:
a = np.where(titanic_train['Age'].isnull() ==True)
a

(array([  5,  17,  19,  26,  28,  29,  31,  32,  36,  42,  45,  46,  47,
         48,  55,  64,  65,  76,  77,  82,  87,  95, 101, 107, 109, 121,
        126, 128, 140, 154], dtype=int64),)

In [196]:
pd.DataFrame(a)

,0,1,2,3,4,5,6,7,8,9,...,20,21,22,23,24,25,26,27,28,29
0,5,17,19,26,28,29,31,32,36,42,...,87,95,101,107,109,121,126,128,140,154

In [197]:
titanic_train['Fare']

0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
151    66.6000
152     8.0500
153    14.5000
154     7.3125
155    61.3792
Name: Fare, Length: 156, dtype: float64

In [198]:
titanic_train.Fare.max()

263.0

In [199]:
max(titanic_train.Fare)

263.0

# if i want to index vaue

In [200]:
row_index  = np.where(titanic_train['Fare'] == max(titanic_train['Fare']))
row_index

(array([27, 88], dtype=int64),)

# Concatination with two col and create a new

In [202]:
titanic_train['Family'] = titanic_train['SibSp'] + titanic_train['Parch']
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,cabin_1,Family
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,n,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,n,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,C,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,n,0

In [203]:
most_family = np.where(titanic_train['Family'] == max(titanic_train['Family']))
most_family

(array([59, 71], dtype=int64),)

In [204]:
titanic_train.iloc[most_family]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,cabin_1,Family
59,60,0,3,"Goodwin, Master. William Frederick",male,11.0,5,2,CA 2144,46.9,NaN,S,n,7
71,72,0,3,"Goodwin, Miss. Lillian Amy",female,16.0,5,2,CA 2144,46.9,NaN,S,n,7

In [206]:
import pandas as pd
import numpy as np 
labels = ['a','b','c']
my_data = [10,20,30]

In [207]:
pd.Series(my_data)

0    10
1    20
2    30
dtype: int64

In [208]:
#own index name 
pd.Series(my_data, index=['a','b','c'])

a    10
b    20
c    30
dtype: int64

In [209]:
se = pd.Series(my_data, index = ['a','b','c'])
se

a    10
b    20
c    30
dtype: int64

In [210]:
se[0]

10

In [211]:
d = {'a':"kjhk", 'b':20, 'c':30}
d.items
pd.DataFrame(d, index=['s','k','m'])

      a   b   c
s  kjhk  20  30
k  kjhk  20  30
m  kjhk  20  30

In [212]:
print('holding object from a dict ', '-'*40)
pd.Series([type, sum, max, min])

holding object from a dict  ----------------------------------------

0             <class 'type'>
1    <built-in function sum>
2    <built-in function max>
3    <built-in function min>
dtype: object

In [213]:
ser1 = pd.Series([1,2,3,4,5],['CA', 'OR', 'NV', 'AZ', 'PT'])
ser2 = pd.Series([1,2,3,4,5],['CA', 'OR', 'NV', 'AZ', 'PT'])
ser1 + ser2

CA     2
OR     4
NV     6
AZ     8
PT    10
dtype: int64

In [214]:
ser1 = pd.Series([1,2,3,4,5],['CA', 'OR', 'NV', 'AZ', 'PT'])
ser2 = pd.Series([1,2,5,3,4],['CA', 'aOR', 'NV', 'aAZ', 'PT'])
ser1+ser2

AZ     NaN
CA     2.0
NV     8.0
OR     NaN
PT     9.0
aAZ    NaN
aOR    NaN
dtype: float64

In [215]:
ser1*ser2

AZ      NaN
CA      1.0
NV     15.0
OR      NaN
PT     20.0
aAZ     NaN
aOR     NaN
dtype: float64